app/controllers/static_pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  		@user_first_name = User.find(params[:id]).firstname
    	@user_last_name = User.find(params[:id]).lastname