app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @all_users = User.all

INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Papy "], ["lastname", "Brossard"], ["email", "papyb@gmail.com"], ["created_at", "2018-08-06 16:29:00.335857"], ["updated_at", "2018-08-06 16:29:00.335857"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user_first_name = User.find(params[:id]).firstname
    @user_last_name = User.find(params[:id]).lastname